In [3]:
import pandas as pd 
import csv

- filepath: Path of the file to be read.
- sep: Character(s) that are used as a field separator in the file.
- header: Index of the row containing the names of the columns (None if none).
- index_col: Index of the column or sequence of indexes that should be used as index of rows of the data.
- names: Sequence containing the names of the columns (used together with header = None).
- skiprows: Number of rows or sequence of row indexes to ignore in the load.
- na_values: Sequence of values that, if found in the file, should be treated as NaN.
- dtype: Dictionary in which the keys will be column names and the values will be types of NumPy to which their content must be converted.
- parse_dates: Flag that indicates if Python should try to parse data with a format similar to dates as dates. You can enter a list of column names that must be joined for the parsing as a date.
- date_parser: Function to use to try to parse dates.
- nrows: Number of rows to read from the beginning of the file.
- skip_footer: Number of rows to ignore at the end of the file.
- encoding: Encoding to be expected from the file read.
- squeeze: Flag that indicates that if the data read only contains one column the result is a Series instead of a DataFrame.
- thousands: Character to use to detect the thousands separator.
- decimal: Character to use to detect the decimal separator.
- skip_blank_lines: Flag that indicates whether blank lines should be ignored.

In [4]:
csv_url = "https://raw.githubusercontent.com/datasets/gdp/master/data/gdp.csv"

pd.read_csv(csv_url).head()

  Country Name Country Code  Year         Value
0   Arab World          ARB  1968  2.576068e+10
1   Arab World          ARB  1969  2.843420e+10
2   Arab World          ARB  1970  3.138550e+10
3   Arab World          ARB  1971  3.642691e+10
4   Arab World          ARB  1972  4.331606e+10

In [2]:
pd.read_csv?

In [5]:
df = pd.read_csv(
    'RDP-Reading-Data-with-Python-and-Pandas-master/unit-1-reading-data-with-python-and-pandas/lesson-1-reading-csv-and-txt-files/files/btc-market-price.csv',
    header=None
)

df.head()

             0            1
0  2/4/17 0:00  1099.169125
1  3/4/17 0:00     1141.813
2  4/4/17 0:00            ?
3  5/4/17 0:00  1133.079314
4  6/4/17 0:00            -

In [8]:
df[1].unique()

array(['1099.169125', '1141.813', '?', '1133.079314', '-', '1181.149838',
       '1208.8005', '1207.744875', '1226.617038', '1218.92205',
       '1180.023713', '1185.260057', '1184.880671', '1186.927413',
       '1216.186743', '1217.930088', '1241.686325', '1258.361413',
       '1261.311225', '1257.988113', '1262.902775', '1279.414688',
       '1309.109875', '1345.353913', '1331.294429', '1334.979038',
       '1417.172813', '1452.076288', '1507.576857', '1508.292125',
       '1533.335071', '1560.4102', '1535.868429', '1640.619225',
       '1721.284971', '1762.88625', '1820.990563', '1720.4785',
       '1771.920013', '1776.3165', '1723.126938', '1739.031975',
       '1807.485063', '1899.082888', '1961.520488', '2052.909788',
       '2046.534463', '2090.662313', '2287.710288', '2379.193833',
       '2387.206286', '2211.976857', '2014.052963', '2192.9808',
       '2275.9307', '2239.205343', '2285.933914', '2399.242671',
       '2446.142414', '2525.765158', '2516.173143', '2698.313813',
       '2883.313697', '2664.920863', '2792.999188', '2827.4913',
       '2845.372857', '2961.829612', '2657.675063', '2748.185086',
       '2447.041563', '2442.48025', '2464.959814', '2665.927',
       '2507.389252', '2617.210263', '2754.97825', '2671.04325',
       '2727.288013', '2710.412286', '2589.164888', '2512.366286',
       '2436.451057', '2517.903114', '2585.349186', '2544.414475',
       '2477.641375', '2434.077863', '2501.191343', '2561.225429',
       '2599.729838', '2619.187503', '2609.96775', '2562.130662',
       '2536.238938', '2366.170143', '2369.862129', '2385.748571',
       '2354.783417', '2190.947833', '2058.9956', '1931.2143',
       '2176.623488', '2320.12225', '2264.7657', '2898.188417',
       '2682.195363', '2807.609857', '2725.549717', '2751.821029',
       '2560.997917', '2495.028586', '2647.625', '2781.636583',
       '2722.512786', '2745.955417', '2866.431667', '2710.413067',
       '2693.633983', '2794.117717', '2873.851083', '3218.115017',
       '3252.562533', '3407.226833', '3457.374333', '3357.326317',
       '3424.4042', '3632.506667', '3852.802914', '4125.54802',
       '4282.992', '4217.028329', '4360.876871', '4328.725717',
       '4130.440067', '4222.662214', '4157.958033', '4043.722',
       '4082.180983', '4174.95', '4340.316717', '4363.05445',
       '4360.513317', '4354.308333', '4391.673517', '4607.98545',
       '4594.98785', '4748.255', '4911.740017', '4580.38748',
       '4648.159983', '4344.098317', '4488.72014', '4641.822017',
       '4654.6585', '4310.750183', '4375.55952', '4329.955',
       '4248.090017', '4219.036617', '3319.63', '3774.265283',
       '3763.62604', '3746.060783', '4093.316667', '3943.413333',
       '3977.561667', '3658.898183', '3637.50255', '3776.3869',
       '3703.04065', '3942.555', '3910.307383', '4202.554983',
       '4201.98905', '4193.574667', '4335.368317', '4360.722967',
       '4386.88375', '4293.3066', '4225.175', '4338.852', '4345.603333',
       '4376.191667', '4602.280883', '4777.967817', '4782.28',
       '4819.485767', '5325.130683', '5563.806567', '5739.438733',
       '5647.311667', '5711.205867', '5603.71294', '5546.1761',
       '5727.6335', '5979.45984', '6020.371683', '5983.18455',
       '5876.079867', '5505.827767', '5669.622533', '5893.138417',
       '5772.504983', '5776.69695', '6155.43402', '6105.87422',
       '6388.645167', '6665.306683', '7068.0201', '7197.72006',
       '7437.543317', '7377.012367', '6989.071667', '7092.127233',
       '7415.87825', '7158.03706', '6719.39785', '5716.301583',
       '6550.227533', '6635.412633', '7301.42992', '7815.0307',
       '7786.884367', '7817.140383', '8007.654067', '8255.596817',
       '8059.8', '8268.035', '8148.95', '8250.978333', '8707.407267',
       '9284.1438', '9718.29505', '9952.50882', '9879.328333',
       '10147.372', '10883.912', '11071.36833', '11332.622', '11584.83',
       '11878.43333', '13540.98', '16501.97167', '16007.43667',
       '15142.83415', '14869.805', '16762.11667', '17276.39333',
       '16808.36667', '16678.892', '17771.9', '19498.68333', '19289.785',
       '18961.85667', '17737.11167', '16026.27167', '16047.51',
       '15190.945', '15360.26167', '13949.175', '14119.02833',
       '15999.04833', '14380.58167', '14640.14', '13215.574', '14165.575',
       '13812.18667', '15005.85667', '15053.26167', '15199.355',
       '17174.12', '17319.198', '16651.47167', '15265.90667',
       '14714.25333', '15126.39833', '13296.794', '13912.882',
       '14499.77333', '13852.92', '14012.196', '11180.99833',
       '11116.94667', '11345.42333', '11422.44', '12950.79333',
       '11505.228', '10544.59333', '11223.064', '11282.25833', '11214.44',
       '10969.815', '11524.77667', '11765.71', '11212.655', '10184.06167',
       '10125.01333', '9083.258333', '8901.901667', '9076.678333',
       '8400.648333', '6838.816667', '7685.633333', '8099.958333',
       '8240.536667', '8535.516667', '8319.876566', '8343.455',
       '8811.343333', '8597.7675', '9334.633333', '9977.154',
       '10127.16167', '10841.99167', '11110.965', '11390.39167',
       '10532.79167', '9931.071667', '10162.11667', '9697.956',
       '9696.593333', '10348.60333', '10763.88333', '10370.165',
       '11009.38167', '11055.815', '11326.94833', '11430.18167',
       '11595.54', '10763.19833', '10118.058', '9429.111667',
       '9089.278333', '8746.002', '9761.396667', '9182.843333', '9154.7',
       '8151.531667', '8358.121667', '8530.402', '7993.674644',
       '8171.415', '8986.948333', '8947.753333', '8690.408333',
       '8686.826667', '8662.378333', '8617.296667', '8197.548333',
       '7876.195', '7960.38', '7172.28', '6882.531667', '6935.48',
       '6794.105'], dtype=object)

In [9]:
df = pd.read_csv(
    'RDP-Reading-Data-with-Python-and-Pandas-master/unit-1-reading-data-with-python-and-pandas/lesson-1-reading-csv-and-txt-files/files/btc-market-price.csv',
    header=None,
    na_values=['','?','-']
)

df.head()

             0            1
0  2/4/17 0:00  1099.169125
1  3/4/17 0:00  1141.813000
2  4/4/17 0:00          NaN
3  5/4/17 0:00  1133.079314
4  6/4/17 0:00          NaN

In [13]:
df = pd.read_csv(
    'RDP-Reading-Data-with-Python-and-Pandas-master/unit-1-reading-data-with-python-and-pandas/lesson-1-reading-csv-and-txt-files/files/btc-market-price.csv',
    header=None,
    na_values=['','?','-'],
    names=['Timestamp','Price']
)

df.head()

     Timestamp        Price
0  2/4/17 0:00  1099.169125
1  3/4/17 0:00  1141.813000
2  4/4/17 0:00          NaN
3  5/4/17 0:00  1133.079314
4  6/4/17 0:00          NaN

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 365 entries, 0 to 364
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Timestamp  365 non-null    object
 1   Price      354 non-null    float64
dtypes: float64(1), object(1)
memory usage: 5.8+ KB

In [15]:
df['Timestamp'] = pd.to_datetime(df['Timestamp'])

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 365 entries, 0 to 364
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Timestamp  365 non-null    datetime64[ns]
 1   Price      354 non-null    float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 5.8 KB

In [16]:
df.head()

   Timestamp        Price
0 2017-02-04  1099.169125
1 2017-03-04  1141.813000
2 2017-04-04          NaN
3 2017-05-04  1133.079314
4 2017-06-04          NaN

In [17]:
df = pd.read_csv(
    'RDP-Reading-Data-with-Python-and-Pandas-master/unit-1-reading-data-with-python-and-pandas/lesson-1-reading-csv-and-txt-files/files/btc-market-price.csv',
    header=None,
    na_values=['','?','-'],
    names=['Timestamp','Price'],
    parse_dates=[0],
    dtype={'Price':'float'}
)

df.head()

   Timestamp        Price
0 2017-02-04  1099.169125
1 2017-03-04  1141.813000
2 2017-04-04          NaN
3 2017-05-04  1133.079314
4 2017-06-04          NaN

In [19]:
df.dtypes

Timestamp    datetime64[ns]
Price               float64
dtype: object

# A more challenging parsing

In [20]:
exam_df = pd.read_csv(
    'RDP-Reading-Data-with-Python-and-Pandas-master/unit-1-reading-data-with-python-and-pandas/lesson-1-reading-csv-and-txt-files/files/exam_review.csv'
)

exam_df.head()

                               first_name>last_name>age>math_score>french_score
Ray>Morley>18>"68     000">"75                                             000"
Melvin>Scott>24>77>83 NaN                                                   NaN
Amirah>Haley>22>92>67 NaN                                                   NaN
Gerard>Mills>19>"78   000">72                                               NaN
Amy>Grimes>23>91>81   NaN                                                   NaN

In [21]:
exam_df = pd.read_csv(
    'RDP-Reading-Data-with-Python-and-Pandas-master/unit-1-reading-data-with-python-and-pandas/lesson-1-reading-csv-and-txt-files/files/exam_review.csv',
    sep='>'
)

exam_df.head()

  first_name last_name  age math_score french_score
0        Ray    Morley   18     68,000       75,000
1     Melvin     Scott   24         77           83
2     Amirah     Haley   22         92           67
3     Gerard     Mills   19     78,000           72
4        Amy    Grimes   23         91           81

In [22]:
exam_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    5 non-null      object
 1   last_name     5 non-null      object
 2   age           5 non-null      int64
 3   math_score    5 non-null      object
 4   french_score  5 non-null      object
dtypes: int64(1), object(4)
memory usage: 328.0+ bytes

In [24]:
exam_df = pd.read_csv(
    'RDP-Reading-Data-with-Python-and-Pandas-master/unit-1-reading-data-with-python-and-pandas/lesson-1-reading-csv-and-txt-files/files/exam_review.csv',
    sep='>',
    decimal=','
)

exam_df.head()

  first_name last_name  age  math_score  french_score
0        Ray    Morley   18        68.0          75.0
1     Melvin     Scott   24        77.0          83.0
2     Amirah     Haley   22        92.0          67.0
3     Gerard     Mills   19        78.0          72.0
4        Amy    Grimes   23        91.0          81.0

In [25]:
exam_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    5 non-null      object
 1   last_name     5 non-null      object
 2   age           5 non-null      int64
 3   math_score    5 non-null      float64
 4   french_score  5 non-null      float64
dtypes: float64(2), int64(1), object(2)
memory usage: 328.0+ bytes

## Saving file

In [26]:
exam_df.to_csv('out.csv')